init-files/functions.org
#+TITLE: functions.org - 2026
#+AUTHOR: Chris
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle "~/.emacs.d/init-files/functions.el"
#+auto_tangle: t

* Functions
** Visual bell
Disables the audio bell and sets up the visual bell
#+begin_src emacs-lisp
  (defun visual-bell ()
    (invert-face 'mode-line-active)
    (invert-face 'mode-line-inactive)
    (run-with-timer 0.1 nil #'invert-face 'mode-line-active)
    (run-with-timer 0.1 nil #'invert-face 'mode-line-inactive))
#+end_src
* Interactive functions
** sudo-shell-command
#+begin_src emacs-lisp
  (defun sudo-shell-command (command)
    (interactive "Command: ")
    (with-temp-buffer
      (cd "/sudo::/")
      (async-shell-command command)))
#+end_src
** Shutdown computer function
#+begin_src emacs-lisp
  (defun shutdown-computer ()
    "Prompt the user to shutdown the computer using `shutdown now`."
    (interactive)
    (when (yes-or-no-p "Are you sure you want to shutdown the computer? ")
      (shell-command "shutdown now")))
#+end_src
** Update mandb function
#+begin_src emacs-lisp
  (defun mandb ()
    "Prompt the user to update the mandb."
    (interactive)
    (when (yes-or-no-p "Update mandb? ")
      (sudo-shell-command "mandb")))
#+end_src
** Update locatedb function
#+begin_src emacs-lisp
  (defun updatedb ()
    "Promt the user to update the locate database."
    (interactive)
    (when (yes-or-no-p "Update locate database? ")
      (sudo-shell-command "updatedb")))
#+end_src
** htop
#+begin_src emacs-lisp
  (defun htop ()
    "Open htop in a vterm buffer"
    (interactive)
    (require 'vterm)

    (let ((buf (vterm "*htop*")))
      (with-current-buffer buf
        
        ;; Clear any prompt and run htop
        (vterm-send-string "exec htop")
        (vterm-send-return))
      buf))
#+end_src
* Initialize
#+begin_src emacs-lisp
  (provide 'functions)
#+end_src
